/* Started by AICoder, pid:wadd41d471e2ad6142b20a50c076ab64c28169bc */
/******************************************************************************
 * 版权所有 (C)2016, 深圳市中兴通讯股份有限公司
 * 模块名          : MCS
 * 文件名          : psNcuDAProfileCtxProc.h
 * 相关文件        :
 * 文件实现功能     : DAProfile上下文
 * 归属团队        : M6
 * 版本           : V7.24.30
 -------------------------------------------------------------------------------
 * 修改记录:
 * 修改日期           版本号           修改人           修改内容
 * 2024-09-20    V7.24.30              wya          create
 ******************************************************************************/
#ifndef _PS_NCU_DAPROFILE_CTX_PROC_
#define _PS_NCU_DAPROFILE_CTX_PROC_

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************
 *                              头文件(满足自包含，满足最小依赖)
 **************************************************************************/
#include "r_ncu_daprofile.h"
/**************************************************************************
 *                              宏(对外提供)
 **************************************************************************/

/**************************************************************************
 *                              数据类型(对外提供)
 **************************************************************************/

/**************************************************************************
 *                              接口(对外提供，最小可见)
 **************************************************************************/
VOID CfgChgDAProfileProc(WORD16 wOperation, WORD16 wDataMsgLen, BYTE *lpData);
VOID getDAProfileAllCfg();
DBBOOL queryDAProfileCtx(lp_r_dyn_daprofile_idx_application idx,T_VpfuDAProfileCtx **ptDAProfileTuple);
/**************************************************************************
 *                              全局变量声明(对外提供，最小可见)
 **************************************************************************/

#ifdef __cplusplus
}
#endif

#endif // _PS_NCU_DAPROFILE_CTX_PROC_
/* Ended by AICoder, pid:wadd41d471e2ad6142b20a50c076ab64c28169bc */
