/******************************************************************************
* 版权所有 (C)2016, 深圳市中兴通讯股份有限公司
*
* 模块名          : MCS
* 文件名          : psNcuCtrlStatInterface.c
* 相关文件        :
* 文件实现功能     : 管理JOB统计
* 归属团队        : M6
* 版本           : V1.0
-------------------------------------------------------------------------------
* 修改记录:
* 修改日期            版本号           修改人           修改内容
* 2024-4-12        V7.24.20        wya            create
******************************************************************************/
/**************************************************************************
 *                              头文件(满足最小依赖,请按照DDD分层架构逐层依赖)
 **************************************************************************/
#include "psNcuCtrlStatInterface.h"
#include "zte_slibc.h"

/**************************************************************************
 *                              宏(本源文件使用)
 **************************************************************************/

/**************************************************************************
 *                              常量(本源文件使用)
 **************************************************************************/

/**************************************************************************
 *                              数据类型(本源文件使用)
 **************************************************************************/

/**************************************************************************
 *                              外部函数原型(评估后慎重添加)
 **************************************************************************/

/**************************************************************************
 *                              局部函数原型(本源文件使用)
 **************************************************************************/

/**************************************************************************
 *                              全局变量(本源文件使用)
 **************************************************************************/
T_psNcuMcsJobStat g_tNcuMcsJobStat = {0};
/**************************************************************************
 *                              函数实现(函数布局:总分结构|深度优先)
 **************************************************************************/
VOID ncujob(VOID)
{
#ifdef MSC_STAT_ITEM_SEG
#undef MSC_STAT_ITEM_SEG
#endif
#define MSC_STAT_ITEM_SEG(seg_name) zte_printf_s("\n\n %50s----%s----\n", " ",seg_name);

#ifdef MSC_STAT_ITEM
#undef MSC_STAT_ITEM
#endif
#define MSC_STAT_ITEM(item_name) if(g_tNcuMcsJobStat.item_name>0) zte_printf_s("    %50s    = %llu\n", #item_name, g_tNcuMcsJobStat.item_name);

#ifdef MSC_STAT_ITEM_ARRAY
#undef MSC_STAT_ITEM_ARRAY
#endif
#define MSC_STAT_ITEM_ARRAY(item_name, array_size) do\
{\
    int i=0;\
    for(i=0; i<array_size; i++)\
    {\
        if(g_tNcuMcsJobStat.item_name[i]>0)\
            zte_printf_s("    %46s[%d]    = %llu\n", #item_name, i, g_tNcuMcsJobStat.item_name[i]);\
    }\
}while(0);

    #include "psNcuCtrlStatItemDef.h"

    zte_printf_s("\n");
    return;
}

VOID ncujobc()
{
    zte_memset_s(&g_tNcuMcsJobStat, sizeof(T_psNcuMcsJobStat), 0, sizeof(T_psNcuMcsJobStat));
}


//end of file
