/******************************************************************************
版权所有 (C)2016, 深圳市中兴通讯股份有限公司

模块名          : MCS
文件名          : psMcsDbCommonDynTables.c
相关文件        :
文件实现功能     : 媒体面Common动态库
作者            :
版本            : V7.23.30
-------------------------------------------------------------------------------
修改记录:
* 修改日期            版本号           修改人              修改内容
* 2023-06-01        V7.23.30                            create
******************************************************************************/
/**************************************************************************
 *                               头文件(满足最小依赖)
 **************************************************************************/
#include "psDbCommonDynTables.h"
#include "r_ncu_daprofile.h"
#include "r_ncu_applicationmap.h"
#include "r_dyn_upf_logctl.h"
#include "r_ncu_subbindapp.h"
#include "r_ncu_dadial.h"
/**************************************************************************
 *                                   宏(本源文件使用)
 **************************************************************************/


/**************************************************************************
 *                                  常量(本源文件使用)
 **************************************************************************/

/**************************************************************************
 *                                数据类型(本源文件使用)
 **************************************************************************/

/**************************************************************************
 *                                全局变量(本源文件使用)
 **************************************************************************/

/**************************************************************************
 *                              外部函数原型(评估后慎重添加)
 **************************************************************************/
/**************************************************************************
 *                              局部函数原型(本源文件使用)
 **************************************************************************/

/**************************************************************************
 *                                函数实现(函数布局:总分结构|深度优先)
 **************************************************************************/
/**********************************************************************
* 函数名称： create_ncu_common_dyn_tables
* 功能描述：创建pfu网元的连续内存的公共库的动态表表
* 输入参数：dwDbHandle 动态库句柄
* 输出参数：无
* 返 回 值：TRUE, 成功; FALSE, 失败
* 其它说明：
* 创建日期       版本号              创建人       修改内容
* -----------------------------------------------
* 2023-06-01     ZXUN-xGW V7.23.30  ddd       新建
***********************************************************************/
BOOL create_ncu_common_dyn_tables(DWORD dwDbHandle)
{
    _DB_STATEMENT_FALSE_RTN_FALSE(create_r_dyn_daprofile(dwDbHandle), LOG_EMERGENCY);
    _DB_STATEMENT_FALSE_RTN_FALSE(create_r_ncu_appidmap(dwDbHandle), LOG_EMERGENCY);
    _DB_STATEMENT_FALSE_RTN_FALSE(create_dyn_upflogctl(dwDbHandle),LOG_EMERGENCY);
    _DB_STATEMENT_FALSE_RTN_FALSE(create_r_ncu_appid_relation(dwDbHandle), LOG_EMERGENCY);
    _DB_STATEMENT_FALSE_RTN_FALSE(create_r_ncu_dadial(dwDbHandle), LOG_EMERGENCY);
    return TRUE;
}
//end of file
