/******************************************************************************
版权所有 (C)2016, 深圳市中兴通讯股份有限公司

模块名          : MCS
文件名          : psMcsUcomMsg.h
相关文件        :
文件实现功能     : Ucom通道报文处理
作者            :
版本            : V1.0
-------------------------------------------------------------------------------
修改记录:
日  期      版本        修改人      修改内容
* 2023-08-30        V7.23.20        xxx             create
******************************************************************************/
#ifndef  PS_MCS_UCOM_MSG_H
#define  PS_MCS_UCOM_MSG_H
#ifdef __cplusplus
extern "C" {
#endif
/**************************************************************************
 *                              头文件(满足自包含)
 **************************************************************************/
#include "psUpfEvent.h"
#include "ps_mcs_define.h"

/**************************************************************************
 *                              宏(对外提供)
 **************************************************************************/

/**************************************************************************
 *                              数据类型(对外提供)
 **************************************************************************/

/**************************************************************************
 *                              接口(对外提供，最小可见)
 **************************************************************************/
VOID psMcsUcomNcu2McsReqProc(T_MediaProcThreadPara *ptMediaProcThreadPara, BYTE *aucPacketBuf, T_psUpfUcomHead *ptNcuUcomHead);
VOID psNcuUcomMediaProc(T_MediaProcThreadPara *ptMediaProcThreadPara, BYTE *aucPacketBuf, T_psUpfUcomHead *ptNcuUcomHead);
#ifdef __cplusplus
}
#endif
#endif
//end of file

