/******************************************************************************
版权所有 (C)2016, 深圳市中兴通讯股份有限公司

模块名          : MCS
文件名          : psNcuSigTrace.h
相关文件         :
文件实现功能       : NCU信令跟踪
作者           : wjm
版本           : V1.0
-------------------------------------------------------------------------------
修改记录:
日  期                 版本             修改人             修改内容
* 2024-04-22        V7.23.20         M7             modify
******************************************************************************/

#ifndef _PS_NCU_SIGTRACE_H_
#define _PS_NCU_SIGTRACE_H_

#ifdef __cplusplus  
extern "C" {
#endif
/**************************************************************************
 *                              头文件(满足自包含)
 **************************************************************************/
#include "ps_ncu_session.h"


/**************************************************************************
 *                              宏(对外提供)
 **************************************************************************/


/**************************************************************************
 *                              数据类型(对外提供)
 **************************************************************************/


/**************************************************************************
 *                              接口(对外提供，最小可见)
 **************************************************************************/
VOID sigtrace_udp_report(T_psNcuSessionCtx* ptSessionCtx, BYTE event, const BYTE *msg, WORD16 msglen);
VOID sigtrace_sbi_report(T_psNcuSessionCtx* ptSessionCtx);
VOID sigtrace_node_report(BYTE direct, BYTE event, const BYTE *msg, WORD16 msglen);

#ifdef __cplusplus  
}
#endif


#endif


